bases/Wim_Du/projects/35879/Расширения/optOst/Documents/Сделка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Сделка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПортфеля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПортфелей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСделка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетУчетаАктива</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВалютаЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорДУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорДУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеМестоХраненияДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АналитическийСчетДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитическиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВнебиржеваяСделка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПлановаяПозиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеПлановойПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

bases/Wim_Du/projects/35879/Расширения/optOst/Documents/Сделка/Ext/ObjectModule.bsl
&Вместо("ТекстЗапросаТаблицыПоПродажамБУ_БезНКД")
Функция optOst_ТекстЗапросаТаблицыПоПродажамБУ_БезНКД(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВТ_ХозрасчетныйОстатки"         , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ОстаткиТело"                 , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ОстаткиПереоценка"           , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаАктивы"		   , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СписаниеАктивовТаблицаАктивы"   , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СписаниеАктивовОстатки"         , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СписаниеАктивовПереоценка"      , НомераТаблиц.Количество());
	НомераТаблиц.Вставить("КоличествоВсего"				   , НомераТаблиц.Количество());
	// IMAPPS-35879 ++
	МесяцДокументаСовпадаетСТекущим = (НачалоМесяца(Дата) = НачалоМесяца(ТекущаяДатаСеанса()));
	ТекстЗапроса = ПолучитьТекстФрагментаВТ_ХозрасчетныйОстатки(МесяцДокументаСовпадаетСТекущим) +
	// IMAPPS-35879 --
	"|
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Актив КАК Актив,
	|	ВТ_ХозрасчетныйОстатки.Счет КАК Счет,
	|	ВТ_ХозрасчетныйОстатки.Валюта КАК Валюта,
	|	ВТ_ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|	ВТ_ХозрасчетныйОстатки.Субконто2 КАК Партия,
	|	ВТ_ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ_ХозрасчетныйОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт
	|ПОМЕСТИТЬ ВТ_ОстаткиТело
	|ИЗ
	|	ВТ_ХозрасчетныйОстатки КАК ВТ_ХозрасчетныйОстатки
	|ГДЕ
	|	ВТ_ХозрасчетныйОстатки.Счет = &СчетУчетаАктива
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ХозрасчетныйОстатки.Счет КАК Счет,
	|	ВТ_ХозрасчетныйОстатки.Валюта КАК Валюта,
	|	ВТ_ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|	ВТ_ХозрасчетныйОстатки.Субконто2 КАК Партия,
	|	ВТ_ХозрасчетныйОстатки.СуммаОстаток,
	|	ВТ_ХозрасчетныйОстатки.ВалютнаяСуммаОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиПереоценка
	|ИЗ
	|	ВТ_ХозрасчетныйОстатки КАК ВТ_ХозрасчетныйОстатки
	|ГДЕ
	|	ВТ_ХозрасчетныйОстатки.Счет = &СчетУчетаАктиваПереоценка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1,
	|	Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сделка.Ссылка,
	|	1 КАК НомерСтроки,
	|	Сделка.Актив,
	|	&АктивОбъект КАК АктивОбъект,
	|	Сделка.Количество,
	|	ВЫРАЗИТЬ(Сделка.Сумма КАК ЧИСЛО(15, 2)) КАК СуммаВзаиморасчетов,
	|	ВЫРАЗИТЬ(Сделка.НКД КАК ЧИСЛО(15, 2)) КАК НКД,
	|	Сделка.СчетУчетаАктива КАК СчетУчета,
	|	Сделка.ВалютаДокумента КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(Сделка.ВалютаЦБ, Сделка.ВалютаДокумента) КАК ВалютаЦБ,
	|	Сделка.КурсЦБ КАК КурсВалютыЦБ,
	|	Сделка.КратностьЦБ КАК КратностьВалютыЦБ,
	|	Сделка.ВидОбращаемости,
	|	Сделка.СчетУчетаРасчетовСКонтрагентом
	|ПОМЕСТИТЬ ТаблицаАктивы
	|ИЗ
	|	Документ.Сделка КАК Сделка
	|ГДЕ
	|	Сделка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	""Активы"" КАК ИмяСписка,
	|	ТаблицаАктивы.НомерСтроки КАК НомерСтроки,
	|	ТаблицаАктивы.СчетУчета,
	|	ТаблицаАктивы.Актив,
	|	ТаблицаАктивы.АктивОбъект КАК АктивОбъект,
	|	ТаблицаАктивы.ВалютаЦБ,
	|	ТаблицаАктивы.КурсВалютыЦБ КАК КурсВалютыЦБ,
	|	ТаблицаАктивы.КратностьВалютыЦБ КАК КратностьВалютыЦБ,
	|	ТаблицаАктивы.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Себестоимость) КАК КорСчетСписания,
	|	ТаблицаАктивы.ВидОбращаемости КАК КорСубконто1,
	|	ТаблицаАктивы.Актив КАК КорСубконто2,
	|	НЕОПРЕДЕЛЕНО КАК КорСубконто3,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыОбращаемостиЦБ) КАК ВидКорСубконто1,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ЦенныеБумаги) КАК ВидКорСубконто2,
	|	НЕОПРЕДЕЛЕНО КАК ВидКорСубконто3,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПродажаАктивов) КАК СтатьяЗатрат,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПродажаАктивов) КАК СтатьяДДС
	|ИЗ
	|	ТаблицаАктивы КАК ТаблицаАктивы
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ОстаткиАктивов"" КАК ИмяСписка,
	|	ВТ_ХозрасчетныйОстатки.Счет КАК СчетУчета,
	|	ВТ_ХозрасчетныйОстатки.Субконто1 КАК Актив,
	|	ВТ_ХозрасчетныйОстатки.Субконто2 КАК ДокументОприходования,
	
	// IMAPPS-35879 ++
	//|	ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.Субконто2.Дата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДокументОприходованияДата,
	|	ВЫБОР
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.Сделка)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.Сделка).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ПогашениеОблигаций)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ПогашениеОблигаций).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ДокументРасчетовСКонтрагентом).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаРЕПОПерваяНога)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаРЕПОПерваяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ВводВыводЦенныхБумагИзДУ)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ВводВыводЦенныхБумагИзДУ).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ВводНачальныхОстатовПоНКД)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ВводНачальныхОстатовПоНКД).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаРЕПОВтораяНога)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаРЕПОВтораяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ПринятиеКУчетуАктивов)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ПринятиеКУчетуАктивов).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаНаСрочномРынке)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаНаСрочномРынке).Дата
	|	ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДокументОприходованияДата,
	// IMAPPS-35879 --
	
	|	ВТ_ХозрасчетныйОстатки.Валюта,
	|	СУММА(ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.КоличествоОстаток, 0)) КАК Количество,
	|	СУММА(ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.СуммаОстаток, 0)) КАК Стоимость,
	|	СУММА(ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.ВалютнаяСуммаОстаток, 0)) КАК СтоимостьВал,
	|	СУММА(ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.СуммаНУОстаток, 0)) КАК СтоимостьНУ
	|ИЗ
	|	ВТ_ХозрасчетныйОстатки КАК ВТ_ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ХозрасчетныйОстатки.Счет,
	|	ВТ_ХозрасчетныйОстатки.Субконто1,
	|	ВТ_ХозрасчетныйОстатки.Субконто2,
	|	ВТ_ХозрасчетныйОстатки.Валюта,
	
	// IMAPPS-35879 ++
	//|	ЕСТЬNULL(ВТ_ХозрасчетныйОстатки.Субконто2.Дата, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|	ВЫБОР
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.Сделка)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.Сделка).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ПогашениеОблигаций)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ПогашениеОблигаций).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ДокументРасчетовСКонтрагентом).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаРЕПОПерваяНога)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаРЕПОПерваяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ВводВыводЦенныхБумагИзДУ)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ВводВыводЦенныхБумагИзДУ).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ВводНачальныхОстатовПоНКД)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ВводНачальныхОстатовПоНКД).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаРЕПОВтораяНога)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаРЕПОВтораяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.ПринятиеКУчетуАктивов)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.ПринятиеКУчетуАктивов).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ВТ_ХозрасчетныйОстатки.Субконто2) = ТИП(Документ.СделкаНаСрочномРынке)
	|		ТОГДА ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто2    КАК Документ.СделкаНаСрочномРынке).Дата
	|	ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ
	// IMAPPS-35879 --
	
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОприходованияДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&СчетУчетаАктиваПереоценка КАК СчетПереоценки,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.Субконто1, ВТ_ОстаткиПереоценка.Субконто1) КАК АктивОбъект,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.Валюта, ВТ_ОстаткиПереоценка.Валюта) КАК Валюта,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.Партия, НЕОПРЕДЕЛЕНО) КАК ДокументРасчетов,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиПереоценка.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиПереоценка.ВалютнаяСуммаОстаток, 0) КАК ВалютнаяСуммаОстаток,
	|	ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия) КАК Партия,
	
	// IMAPPS-35879 ++
	//|	ЕСТЬNULL(ВТ_ОстаткиТело.Партия.Дата, ВТ_ОстаткиПереоценка.Партия.Дата) КАК Дата
	|	ВЫБОР
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.Сделка)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.Сделка).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ПогашениеОблигаций)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ПогашениеОблигаций).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ДокументРасчетовСКонтрагентом)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ДокументРасчетовСКонтрагентом).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.СделкаРЕПОПерваяНога)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.СделкаРЕПОПерваяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ВводВыводЦенныхБумагИзДУ)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ВводВыводЦенныхБумагИзДУ).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ВводНачальныхОстатовПоНКД)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ВводНачальныхОстатовПоНКД).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.СделкаРЕПОВтораяНога)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.СделкаРЕПОВтораяНога).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.ПринятиеКУчетуАктивов)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.ПринятиеКУчетуАктивов).Дата
	|	 КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)) = ТИП(Документ.СделкаНаСрочномРынке)
	|		ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_ОстаткиТело.Партия, ВТ_ОстаткиПереоценка.Партия)    КАК Документ.СделкаНаСрочномРынке).Дата
	|	ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК Дата
	// IMAPPS-35879 --
	
	|ИЗ
	|	ВТ_ОстаткиТело КАК ВТ_ОстаткиТело
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОстаткиПереоценка КАК ВТ_ОстаткиПереоценка
	|		ПО ВТ_ОстаткиТело.Субконто1 = ВТ_ОстаткиПереоценка.Субконто1
	|			И ВТ_ОстаткиТело.Партия = ВТ_ОстаткиПереоценка.Партия
	|ГДЕ
	|	ЕСТЬNULL(ВТ_ОстаткиТело.КоличествоОстаток, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ОстаткиТело.КоличествоОстаток) КАК КоличествоОстаток,
	|	ВТ_ОстаткиТело.Субконто1 КАК АктивОбъект
	|ИЗ
	|	ВТ_ОстаткиТело КАК ВТ_ОстаткиТело
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиТело.Субконто1";

	Если ЭтоОблигация и БУ тогда
		
		НомераТаблиц.Вставить("ЧастичноеСписание", 				НомераТаблиц.Количество());
		
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияДУ.ТекстРазделителяЗапросовПакета();
		
		ТекстЧОП = "ВЫБРАТЬ
		|	ВТ_ХозрасчетныйОстатки.Счет КАК Счет,
		|	ВТ_ХозрасчетныйОстатки.Валюта,
		|	ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто1 КАК Справочник.Облигации) КАК Облигации,
		|	ВТ_ХозрасчетныйОстатки.Субконто2 КАК ПогашениеОблигаций,
		|	ВЫРАЗИТЬ(ВТ_ХозрасчетныйОстатки.Субконто1 КАК Справочник.Облигации).Эмитент КАК Эмитент,
		|	ВТ_ХозрасчетныйОстатки.СуммаОстаток,
		|	ВТ_ХозрасчетныйОстатки.ВалютнаяСуммаОстаток,
		|	ВТ_ХозрасчетныйОстатки.КоличествоОстаток
		|ИЗ
		|	ВТ_ХозрасчетныйОстатки КАК ВТ_ХозрасчетныйОстатки
		|ГДЕ
		|	ВТ_ХозрасчетныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЧПО)";
		
		ТекстЗапроса = ТекстЗапроса + ТекстЧОП;
	Конецесли;
	
	Если НЕ (ВнебиржеваяСделка ИЛИ ЗначениеЗаполнено(ПлановаяПозиция)) И БУ И ФлагПереоценкиСчетовБрокера = Истина Тогда
		
		НомераТаблиц.Вставить("ПереоценкаСчетовБрокера", 				НомераТаблиц.Количество());
		
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияДУ.ТекстРазделителяЗапросовПакета();
		
		ТекстПСБ = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		           |	ХозрасчетныйОстатки.Счет КАК Счет,
		           |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Субконто1,
		           |	ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто2 КАК Справочник.ДоговорыКонтрагентов) КАК Субконто2,
		           |	ХозрасчетныйОстатки.Субконто3 КАК Субконто3,
		           |	ХозрасчетныйОстатки.Валюта КАК Валюта,
		           |	ВЫБОР
		           |		КОГДА ХозрасчетныйОстатки.СуммаОстаток < 0
		           |			ТОГДА -1 * ХозрасчетныйОстатки.СуммаОстаток
		           |		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток
		           |	КОНЕЦ КАК Сумма,
		           |	ВЫБОР
		           |		КОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт <> 0
		           |			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстатокДт
		           |		ИНАЧЕ ХозрасчетныйОстатки.ВалютнаяСуммаОстатокКт
		           |	КОНЕЦ КАК ВалютнаяСумма,
		           |	ВЫБОР
		           |		КОГДА ХозрасчетныйОстатки.СуммаОстаток < 0
		           |			ТОГДА ЛОЖЬ
		           |		ИНАЧЕ ИСТИНА
		           |	КОНЕЦ КАК РасчетыПоРеализации
		           |ИЗ
		           |	РегистрБухгалтерии.Хозрасчетный.Остатки(
		           |			&Период,
		           |			Счет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыБрокераПоСделкам), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыБрокераПоСделкам55)),
		           |			,
		           |			ДоговорДУ = &ДоговорДУ
		           |				И (ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты)) = &Контрагент
		           |				И (ВЫРАЗИТЬ(Субконто2 КАК Справочник.ДоговорыКонтрагентов)) = &ДоговорКонтрагента
		           |				И Субконто3 = &ФизическоеМХДС) КАК ХозрасчетныйОстатки";
		
		ТекстЗапроса = ТекстЗапроса + ТекстПСБ;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// IMAPPS-35879 ++
// Описание: Возвращает фрагмент текста запроса для заполнения ВТ_ХозрасчетныйОстатки. IMAPPS-35879.
// Выбор варианта по совпадению месяца даты документа с текущим месяцем: при совпадении — оптимизированный
// (актуальные остатки + обороты), иначе — виртуальная таблица Остатки(&Период).
//
// Параметры:
// МесяцДокументаСовпадаетСТекущим - Булево - Истина, если дата документа в текущем месяце.
//
// Возвращаемое значение:
// Строка - фрагмент запроса до "ИНДЕКСИРОВАТЬ ПО Счет" (без общего хвоста).
//
Функция ПолучитьТекстФрагментаВТ_ХозрасчетныйОстатки(МесяцДокументаСовпадаетСТекущим)
	Если МесяцДокументаСовпадаетСТекущим Тогда
		Возврат "ВЫБРАТЬ
		|	Данные.Счет КАК Счет,
		|	Данные.ДоговорДУ КАК ДоговорДУ,
		|	Данные.Валюта КАК Валюта,
		|	Данные.Субконто1 КАК Субконто1,
		|	Данные.Субконто2 КАК Субконто2,
		|	СУММА(Данные.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(Данные.КоличествоОстатокДт) КАК КоличествоОстатокДт,
		|	СУММА(Данные.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(Данные.ВалютнаяСуммаОстаток) КАК ВалютнаяСуммаОстаток,
		|	СУММА(Данные.СуммаНУОстаток) КАК СуммаНУОстаток
		|ПОМЕСТИТЬ ВТ_ХозрасчетныйОстатки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ХозрасчетныйОстатки.Счет КАК Счет,
		|		ХозрасчетныйОстатки.ДоговорДУ КАК ДоговорДУ,
		|		ХозрасчетныйОстатки.Валюта КАК Валюта,
		|		ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|		ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
		|		ХозрасчетныйОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|		ХозрасчетныйОстатки.КоличествоОстатокДт КАК КоличествоОстатокДт,
		|		ХозрасчетныйОстатки.СуммаОстаток КАК СуммаОстаток,
		|		ХозрасчетныйОстатки.ВалютнаяСуммаОстаток КАК ВалютнаяСуммаОстаток,
		|		ХозрасчетныйОстатки.СуммаНУОстатокДт КАК СуммаНУОстаток
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.Остатки(
		|				,
		|				Счет В (&СчетаОстатков),
		|				,
		|				ДоговорДУ = &ДоговорДУ
		|					И Субконто1 = &АктивОбъект
		|					И Валюта = &ВалютаЦБ
		|					И ТИПЗНАЧЕНИЯ(Субконто2) <> ТИП(Документ.СделкаРЕПОПерваяНога)) КАК ХозрасчетныйОстатки
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		ХозрасчетныйОбороты.Счет,
		|		ХозрасчетныйОбороты.ДоговорДУ,
		|		ХозрасчетныйОбороты.Валюта,
		|		ХозрасчетныйОбороты.Субконто1,
		|		ХозрасчетныйОбороты.Субконто2,
		|		-ХозрасчетныйОбороты.КоличествоОборот,
		|		-ХозрасчетныйОбороты.КоличествоОборотДт,
		|		-ХозрасчетныйОбороты.СуммаОборот,
		|		-ХозрасчетныйОбороты.ВалютнаяСуммаОборот,
		|		-ХозрасчетныйОбороты.СуммаНУОборот
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.Обороты(
		|				&Период,
		|				,
		|				,
		|				Счет В (&СчетаОстатков),
		|				,
		|				ДоговорДУ = &ДоговорДУ
		|					И Субконто1 = &АктивОбъект
		|					И Валюта = &ВалютаЦБ
		|					И ТИПЗНАЧЕНИЯ(Субконто2) <> ТИП(Документ.СделкаРЕПОПерваяНога),
		|				,
		|				) КАК ХозрасчетныйОбороты) КАК Данные
		|
		|СГРУППИРОВАТЬ ПО
		|	Данные.Счет,
		|	Данные.ДоговорДУ,
		|	Данные.Валюта,
		|	Данные.Субконто1,
		|	Данные.Субконто2
		|";
	Иначе
		Возврат "ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Счет КАК Счет,
		|	ХозрасчетныйОстатки.ДоговорДУ,
		|	ХозрасчетныйОстатки.Валюта,
		|	ХозрасчетныйОстатки.Субконто1,
		|	ХозрасчетныйОстатки.Субконто2,
		|	ЕСТЬNULL(ХозрасчетныйОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ХозрасчетныйОстатки.КоличествоОстатокДт,
		|	ХозрасчетныйОстатки.СуммаОстаток,
		|	ХозрасчетныйОстатки.ВалютнаяСуммаОстаток,
		|	ХозрасчетныйОстатки.СуммаНУОстатокДт КАК СуммаНУОстаток
		|ПОМЕСТИТЬ ВТ_ХозрасчетныйОстатки
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет В (&СчетаОстатков),
		|			,
		|			ДоговорДУ = &ДоговорДУ
		|				И Субконто1 = &АктивОбъект
		|				И Валюта = &ВалютаЦБ
		|				И ТИПЗНАЧЕНИЯ(Субконто2) <> ТИП(Документ.СделкаРЕПОПерваяНога)) КАК ХозрасчетныйОстатки";
	КонецЕсли;
КонецФункции
// IMAPPS-35879 --
